Channel/1D/R0180/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
1025
(
(2.05878e-08 -1.20036e-12 -3.18015e-12 1.34042e-15 8.44376e-16 6.10549e-09)
(6.18604e-08 -3.60674e-12 -9.55542e-12 4.02756e-15 2.5371e-15 1.83452e-08)
(2.56429e-07 -4.80479e-11 -4.01747e-11 1.88386e-13 3.38112e-14 7.56464e-08)
(4.52036e-07 -9.2732e-11 -7.09576e-11 3.73759e-13 6.52563e-14 1.33253e-07)
(6.48563e-07 -1.37626e-10 -1.01885e-10 5.60003e-13 9.68491e-14 1.91131e-07)
(8.46713e-07 -1.83284e-10 -1.33075e-10 7.53201e-13 1.2898e-13 2.49482e-07)
(1.3736e-06 -4.88759e-10 -2.19096e-10 3.80206e-12 3.43874e-13 4.02459e-07)
(1.90298e-06 -7.95671e-10 -3.05521e-10 6.86526e-12 5.59779e-13 5.56156e-07)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
