Channel/1D/R0180/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
1025
(
(-6.23102e-08 -1.73025e-06 4.38311e-11)
(-6.03833e-07 2.41047e-09 4.2492e-10)
(-1.14579e-06 4.75325e-09 8.06315e-10)
(-1.14622e-06 4.75513e-09 8.06619e-10)
(-1.15324e-06 4.83234e-09 8.11564e-10)
(-4.44328e-06 4.10118e-08 3.12589e-09)
(-7.72631e-06 7.7114e-08 5.43526e-09)
(-7.72633e-06 7.71141e-08 5.43526e-09)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           uniform (-6.23102e-08 -1.73025e-06 4.38311e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
